
[
  {
    "id": "1",
    "title": "Progressive Keratoconus in a Young Adult",
    "author": "Dr. Sarah Miller",
    "authorId": "10",
    "avatar": "https://i.ibb.co/yQWzVvj/corneal-topography-keratoconus.jpg",
    "category": "Cornea & External Disease",
    "tags": ["Keratoconus", "Corneal Cross-Linking", "Ectasia"],
    "description": "A 22-year-old patient presents with a one-year history of decreasing vision in the left eye, now requiring frequent prescription changes. Examination confirms progressive keratoconus. This case explores the decision-making process for corneal cross-linking.",
    "content": "### Patient Presentation\nA 22-year-old male presents with a chief complaint of progressively worsening vision in his left eye over the past 12 months. He reports increasing glare and halos around lights, making night driving difficult. He has a history of seasonal allergies and admits to frequent eye rubbing.\n\n### Examination Findings\n- **Visual Acuity (OD):** 20/20\n- **Visual Acuity (OS):** 20/60, improving to 20/40 with glasses (-2.00 / -3.50 x 095)\n- **Slit Lamp (OS):** Prominent corneal nerves, mild Vogt's striae, and a faint Fleischer ring at the base of the cone.\n- **Corneal Topography (OS):** Shows significant inferior steepening with a maximum keratometry (Kmax) reading of 54.5 D, an increase from 52.0 D recorded 6 months prior.\n- **Pachymetry (OS):** Thinnest point is 450 microns inferiorly.\n\n### Diagnosis\nProgressive keratoconus in the left eye.\n\n> ### Clinical Discussion\n> Given the patient's age, documented progression of ectasia (increase in Kmax), and subjective worsening of symptoms, he is a clear candidate for treatment. The primary management goal is to halt the progression of the disease.\n> \n> **Proposed Plan:**\n> 1.  **Corneal Collagen Cross-Linking (CXL):** Epi-off CXL is recommended for the left eye to stiffen the cornea and prevent further steepening.\n> 2.  **Refractive Management:** Following CXL (typically 3-6 months post-op), the patient will be refit with a rigid gas permeable (RGP) or scleral contact lens to achieve optimal visual acuity.\n> 3.  **Patient Education:** Advise the patient to cease all eye rubbing, as this is a significant risk factor for progression. Manage ocular allergies with appropriate topical mast cell stabilizers or antihistamines.\n\nThis case highlights the importance of early detection and intervention in managing keratoconus. Timely CXL can prevent the need for more invasive procedures like corneal transplantation in the future. What are your standard protocols for CXL in similar cases?",
    "media": [
      {
        "type": "image",
        "url": "https://i.ibb.co/yQWzVvj/corneal-topography-keratoconus.jpg",
        "caption": "Baseline Corneal Topography (OS)"
      },
      {
        "type": "image",
        "url": "https://i.ibb.co/Vvz8r7Y/oct-keratoconus.jpg",
        "caption": "Anterior Segment OCT showing corneal thinning"
      }
    ],
    "mediaCount": 2,
    "lastReply": "1 day ago",
    "postedDate": "2025-11-01T09:00:00Z"
  },
  {
    "id": "2",
    "title": "Management of Severe Non-Proliferative Diabetic Retinopathy",
    "author": "Gemini",
    "authorId": "0",
    "avatar": "https://i.ibb.co/3p3YG47/diabetic-retinopathy.jpg",
    "category": "Retina & Vitreous",
    "tags": ["Diabetic Retinopathy", "NPDR", "Macular Edema"],
    "description": "A 58-year-old female with a 15-year history of type 2 diabetes presents for her annual eye exam. Her last exam was 2 years ago, and she reports intermittent blurry vision. This case reviews the diagnosis and management of severe non-proliferative diabetic retinopathy (NPDR) with clinically significant macular edema (CSME).",
    "content": "### Patient Presentation\nA 58-year-old female with a 15-year history of poorly controlled type 2 diabetes presents for a routine eye examination. She notes that her vision has been intermittently blurry, especially when reading. Her last HbA1c was 9.8%.\n\n### Examination Findings\n- **Visual Acuity (OU):** 20/50, not improving with pinhole.\n- **Fundus Examination (OU):** Reveals extensive dot-and-blot hemorrhages, cotton wool spots, and venous beading in all four quadrants. Hard exudates are present in the macula.\n- **OCT (OU):** Shows significant center-involving macular edema with a central subfield thickness of 450 microns.\n\n### Diagnosis\nSevere Non-Proliferative Diabetic Retinopathy (NPDR) with Clinically Significant Macular Edema (CSME) in both eyes.\n\n> ### Clinical Discussion\n> This patient is at high risk of progressing to proliferative diabetic retinopathy (PDR) and significant vision loss. The presence of severe NPDR and CSME warrants prompt intervention.\n> \n> **Proposed Plan:**\n> 1.  **Intravitreal Anti-VEGF Injections:** Initiate treatment with intravitreal anti-VEGF injections (e.g., Aflibercept or Bevacizumab) in both eyes to treat the macular edema. A loading dose of three monthly injections is recommended.\n> 2.  **Pan-Retinal Photocoagulation (PRP):** Consider PRP if the retinopathy progresses to PDR or if the patient is non-compliant with follow-up appointments.\n> 3.  **Systemic Management:** Crucially, the patient must be referred back to her primary care physician and endocrinologist for improved glycemic control. The importance of tight blood sugar and blood pressure control should be emphasized.\n\nThis case underscores the critical role of regular, comprehensive eye exams for all diabetic patients and the need for a multi-disciplinary approach to management. How would your management change if the patient had a history of cardiovascular events?",
    "media": [
      {
        "type": "image",
        "url": "https://i.ibb.co/3p3YG47/diabetic-retinopathy.jpg",
        "caption": "Fundus photo showing severe NPDR with hemorrhages and exudates."
      },
      {
        "type": "image",
        "url": "https://i.ibb.co/pLmnbS0/oct-macular-edema.jpg",
        "caption": "OCT scan demonstrating center-involving diabetic macular edema."
      }
    ],
    "mediaCount": 2,
    "lastReply": "now",
    "postedDate": "2025-11-02T12:00:00Z"
  }
]
