
{
  "keratoconusCase": [
    {
      "type": "paragraph",
      "content": "A 19-year-old male presented to my clinic with a chief complaint of progressively blurry vision and shadowing in his left eye over the past 6 months. His right eye is asymptomatic."
    },
    {
      "type": "heading",
      "content": "History"
    },
    {
      "type": "list",
      "content": [
        "No significant past ocular history.",
        "No history of eye rubbing.",
        "Family history is negative for keratoconus or other corneal ectasias.",
        "Systemic history is unremarkable."
      ]
    },
    {
      "type": "heading",
      "content": "Examination (Left Eye)"
    },
    {
      "type": "list",
      "content": [
        "**UCVA:** 20/80",
        "**BSCVA:** 20/40 with -1.50 / -4.50 x 075",
        "**Slit Lamp:** Clear cornea, no visible Vogt's striae or Fleischer ring. Deep and quiet anterior chamber.",
        "**Topography:** Shows inferior steepening, but the axis is atypical and the classic \"kissing doves\" pattern is not present. Pachymetry shows thinning inferiorly, but not as dramatic as expected for classic KC."
      ]
    },
    {
      "type": "whatsapp",
      "content": "19M with atypical corneal topography, progressive astigmatism (-1.50/-4.50x075). Suspect early KC vs PMD. No Vogt's striae. Topo maps attached. Seeking opinion on Dx and CXL consideration.",
      "whatsapp": {
        "number": "919876543210",
        "message": "Hello! I'd like to share a case from the Focus Links forum for your opinion."
      }
    },
    {
      "type": "alert",
      "variant": "info",
      "title": "Clinical Question",
      "content": "What are your thoughts on the differential diagnosis? What would be your next steps in management? Would you consider corneal cross-linking at this stage given the documented progression of astigmatism? Any insights would be greatly appreciated."
    }
  ],
  "myopiaControl": [
    {
      "type": "paragraph",
      "content": "I have an 8-year-old patient who has shown a rapid myopic progression of -1.50D over the past year. Current Rx is -3.75D in both eyes. Axial length has increased by 0.6mm in the same period."
    },
    {
      "type": "heading",
      "content": "Interventions Tried"
    },
    {
      "type": "list",
      "content": [
        "**Single Vision Spectacles:** Initially prescribed, but progression continued.",
        "**Multifocal Soft Contact Lenses:** Switched to center-distance multifocal lenses 6 months ago. While the progression slowed slightly, it did not stabilize as much as hoped."
      ]
    },
    {
      "type": "alert",
      "variant": "info",
      "title": "Seeking Clinical Advice",
      "content": "I am now considering either low-dose Atropine (0.05%) therapy or transitioning the patient to DIMS (Defocus Incorporated Multiple Segments) spectacle lenses. I would love to hear from colleagues about their clinical experiences: Has anyone seen more consistent results with one modality over the other in similar high-progressor cases? Are there any specific pearls or pitfalls to watch out for with either option?"
    }
  ],
  "amdCase": [
    {
      "type": "paragraph",
      "content": "A 55-year-old female patient presents with a complaint of significant central vision loss and metamorphopsia in her right eye, which has worsened over the last few months. Her left eye is stable."
    },
    {
      "type": "heading",
      "content": "Clinical Findings (Right Eye)"
    },
    {
      "type": "list",
      "content": [
        "**Visual Acuity:** 20/100 (pinholes to 20/80)",
        "**Amsler Grid:** Shows central scotoma and significant waviness of lines.",
        "**Fundus Examination:** Reveals multiple large, soft drusen throughout the macula. No evidence of hemorrhage or subretinal fluid.",
        "**OCT Scan:** Confirms the presence of large drusen and shows some RPE disruption, but crucially, there is no evidence of Choroidal Neovascularization (CNV) or fluid.",
        "**FAF:** Shows areas of hyper-autofluorescence corresponding to the drusen."
      ]
    },
    {
      "type": "alert",
      "variant": "destructive",
      "title": "Diagnostic Dilemma",
      "content": "The visual loss seems disproportionately severe for non-exudative ('dry') AMD, especially given the lack of CNV. Could this be a form of geographic atrophy that is not clearly visible, or are we potentially looking at an underlying macular dystrophy (e.g., Pattern Dystrophy, Best's) presenting in an unusual way? The patient is very anxious about her vision loss, and I want to ensure we have the right diagnosis before discussing prognosis and management (AREDS2, etc.). Any thoughts from the retina specialists in the community would be highly valuable."
    }
  ],
  "scleralLensFit": [
    {
      "type": "paragraph",
      "content": "I'm managing a 45-year-old patient who underwent a full-thickness penetrating keratoplasty (PKP) in his left eye one year ago for advanced keratoconus. The graft is clear and sutures have been removed, but he is left with significant irregular astigmatism, uncorrectable with spectacles."
    },
    {
      "type": "heading",
      "content": "Current Status"
    },
    {
      "type": "list",
      "content": [
        "**BSCVA (Spectacles):** 20/200",
        "**Refraction:** Highly variable and unreliable retinoscopy reflex.",
        "**Topography:** Shows a highly irregular and asymmetric graft surface, with a steep-flat meridian difference of over 10D."
      ]
    },
    {
      "type": "heading",
      "content": "Plan"
    },
    {
      "type": "paragraph",
      "content": "A scleral lens is the next logical step for visual rehabilitation. However, given the post-PKP topography, I anticipate challenges with achieving a stable fit and adequate vault over the graft-host junction."
    },
    {
      "type": "alert",
      "variant": "info",
      "title": "Questions for the Community",
      "content": "For those experienced in fitting sclerals on post-graft corneas: 1. What are your go-to initial diagnostic lens designs or diameters? 2. Any specific strategies for managing vault over the often-proud graft-host junction? 3. Do you prefer using OCT to guide your fitting, and what are your key clearance targets? All advice is welcome!"
    }
  ]
}
